{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing hero portrait–related features and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short descriptions of their roles and functionality.",
  "frontend/index.css": "Tailwind base setup with extensive OKLCH color variables and global styling for light/dark modes.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, and root mount for the React app.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright text and caffeine.ai attribution.",
  "frontend/src/components/LandingPage.tsx": "Main page composition rendering navigation, all sections, and footer.",
  "frontend/src/components/Nav/StickyNav.tsx": "Sticky navigation bar with scroll detection and smooth anchor scrolling.",
  "frontend/src/components/sections/AboutSection.tsx": "Background section describing teaching experience and tech exploration with fade-in animations.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section displaying email and phone with minimal styling and fade-in animations.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background texture, personal mark, portrait image, headline, tagline, and CTA.",
  "frontend/src/components/sections/SkillsSection.tsx": "Skills grid listing five skill areas with icons and reveal animations.",
  "frontend/src/components/sections/VisionSection.tsx": "Vision section outlining educational philosophy and interest in technology with reveal animations.",
  "frontend/src/config/heroPortrait.ts": "Exports path to the cropped hero portrait asset used in the Hero section.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current Internet Identity, invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useFadeInOnView.ts": "Uses an IntersectionObserver to add a staggered fade-in class to child elements when the referenced element enters the viewport.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status management via AuthClient.",
  "frontend/src/hooks/useMailtoComposer.ts": "Generates and navigates to a mailto URL with optional subject and body parameters.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, fonts, and custom animations for a luxury‑minimal theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Stores project state, goals, constraints, and design guidelines for the personal website."
}